<template>
  <div class="info-wrapper">
    <h3>1. 一般</h3>
    <p>
      本利用規約 (以下「キャンペーン一般利用規約」)
      は、当ウェブサイトを通じて、または当ウェブサイトと関連して、当社がユーザーに提供する様々なキャンペーン
      (以下「キャンペーン」)
      を規定し、ユーザーと当社との間の法的拘束力を持つ契約を構成します。各キャンペーンにはそれぞれ特定の条件が適用され、これらの条件は、関連する広告や見出し
      (またはそれに相当するもの)
      内で、またはリンクを通して、明記するものとします。キャンペーン特有の条件は、本キャンペーン一般利用規約の一部となります。お客様は、キャンペーンに参加することにより、本キャンペーン一般利用規約に従うことに同意するものとします。
    </p>
    <h3>2. その他の条件</h3>
    <p>
      本キャンペーン一般利用規約は、当社の利用規約およびプライバシーポリシーと併読する必要があります。当社の利用規約は、本キャンペーン一般利用規約に組み入れられています。本キャンペーン一般利用規約と当社の利用規約の間に矛盾が生じた場合には、
      (その範囲内に限り) 本キャンペーン一般利用規約の条項が優先されます。
      本キャンペーン一般利用規約内の下線が引かれた言葉は、本キャンペーン一般利用規約内に明記されていない限り、利用規約に明記された意味をもつものとします。
    </p>
    <h3>3. ボーナスポイント</h3>
    <p>
      キャンペーン特有の用語として使われている場合、「クレジットポイント」または「ボーナスポイント」とは、ユーザーのアカウントのポイント (以下「ポイント) に加算されたポイントまたはそれに相当するものを意味します。ポイントは、直接引き出したり、払い戻すことはできず、当ウェブサイトでのプレイに使用する必要があります。キャンペーンによっては、これらのポイントを、キャンペーン内の特定の利用規約を満たすことによって、ユーザーのアカウントのポイントに変換することができます。
    </p>
    <p>
      3.1. フリースピン<br />
       フリースピンは、総計ベット額が設定された特定のゲームに付与されるボーナスの一種です。例 :
      1回のスピンバリュー$0.20のムーンプリンセスで使用できるフリースピン5回。特に記載がない限り、最大ペイライン数、ラインごとの最小ベット額で進呈され、フリースピンから獲得した勝利金は、通常の出金賭け条件が付帯する一般ボーナスとして加算されます。
    </p>
    <p>
      3.2. 一般ボーナス<br />
      一般ボーナスとは、カジノ内のあらゆるゲーム、またはゲームカテゴリーで利用可能な、特定のボーナスポイントを指します
      (例 : $20)。特に記載がない場合、出金賭け条件はポイントの20倍です。
    </p>
    <p>
      3.3. クレジットポイント<br />
      クレジットポイントとは、カジノ内のあらゆるゲーム、またはゲームカテゴリーで利用可能な、特定のボーナスポイントを指します
      (例 :
      ¥20)。クレジットポイントはキャッシュとは別として計算され、クレジットポイントから先に使用されます。クレジットポイントとポイントの開始残高以上に達した場合は超過分をポイント出金できるものとします。またクレジットポイントとポイントのスタート残高を下回った場合は返済義務が発生するものとなります。特に記載がない場合、出金賭け条件はクレジットポイントの20倍です。
    </p>
    <h3>4. ポイント出金賭け条件</h3>
    <p>
      出金賭け条件とは、ユーザーが獲得したクレジットポイントがポイント残高になる前に、ユーザーがプレイする必要のあるクレジットポイントとポイントの合計に対しての倍数を意味します。クレジットポイントの出金賭け条件が満たされるまでは、そのボーナスから生じたすべての勝利ポイントは保留となります通常のポイント出金賭け条件は、獲得額の20倍が適用されます。各キャンペーンには、キャンペーン特有の出金賭け条件があり、これらは、関連するオファー上で明確に記載されています。出金賭け条件は、ポイントを使ってのプレイには適用されません。
      <br />
      <br />
      有効なボーナスの出金賭け条件を満たしているかどうかは、ボーナス情報より、ご確認いただけます。
    </p>

    <h3>5. ポイント出金賭け条件への反映率</h3>
    <p>
      キャンペーンに出金賭け条件がある場合には、以下のように、ゲームによってポイント出金賭け条件への反映率が異なります:
      <br />
      <br />
      ゲームごとの反映率<br />
      スロットおよびアーケード/スキルゲーム<br />
      すべてのスロット (下記の除外スロットは除く)…100%<br />
      テーブルゲーム (ライブカジノを含む)<br /> ルーレット (全種類) 15%<br /> その他すべてのテーブルゲーム
      (全種類のバカラ、ブラックジャック、ポーカー、を含む)…10%
      <br />
      <br />
      その他のゲーム<br /> ビデオビンゴ…100%<br /> ゲームショー…15%<br /> シックボー…15%
      <br />
      <br />
      賭け条件に反映されないゲーム
      <br />

      100 ビット・ダイス 、100 ビット・ダイス・ジャックポット
      、100ビット・ダイス・ラッキー・ナンバー、5ファミリーズ、ブックオブ99、ブロンコ・スピリット、ゴー・ゴールド・フィッシング
      360、ゴッズ・フィッシング、ゴールド・カイ・シェン・フィッシング、ゴールデン・ビューティー、タワークエスト、ジェム・セイバー、リール・ハイスト、アイ・オブ・ザ・クラーケン、パールズ
      オブ
      インディア、キャッシュ・アルティメット、ゾンビ・クイーン、ダイヤモンド・ブリッツ、パイロ・ピクシース、ダブル・ジョーカー、ワイルダーランド、ディノ・オデッセイ、デザート・ジェム、ジェミックス2、ル・カフェ・バー、レイジ・トゥー・リッチズ、サンダーストラック・ワイルド・ライトニング、ゾンビ・ホード、モンキー・ゴッド、ゴールド・トレイン、マジック・オブ・サハラ、エイジ・オブ・アイス・ドラゴンズ
    </p>
    <h3>6. ポイント出金</h3>
    <p>
      出金可能なポイントは、いつでも制限なく引き出すことができます。すべての出金は、当社の規制義務が満たされていることが条件となります。また、出金を行うことにより、すべてのクレジットポイントの残高は無効となります。出金可能なポイントの詳細は、利用規約をご覧ください。
    </p>
    <h3>7. 最高賭け金額の規制</h3>
    <p>ボーナスを使ったゲームプレイでの1度の最大賭け額は以下の通りです。<br /></p>
    <ul>
      <li>スロット…$10</li>
      <li>テーブルゲームならびにライブカジノ…$25</li>
    </ul>
    <h3>8. ゲーム規制</h3>
    <p>
      キャンペーン特定の利用規約に特に記載がない限り、当ウェブサイトのボーナスはすべてのゲームに使用可能です。場合によっては、当社の裁量で、特定のゲームがボーナスプレイから除外されることがあります。ボーナスプレイから除外されるゲームのリストがある場合には、キャンペーンの重要条件に明記されるものとします。
    </p>

    <h3>9. ボーナスの乱用と不正行為</h3>
    <p>
      すべてのポイント出金が処理される前に、不規則なプレイパターンがなかったかどうかの確認が行われます。公正なゲームを提供するため、ゼロトレランス方式
      (いかなる違反も許されないの意)
      に基づき、ボーナスの濫用や不規則なプレイ、不正行為に対しては厳しい措置が取られます。ユーザーが、以下の活動のひとつまたは複数に従事している、または従事したことがあることを発見した場合、またはそうとみなした場合には、当社で調査を行い、その結果がわかるまで、申請中のポイント出金要請を含むユーザーのアカウントの使用を制限する権利を有します。
      <br />
      <ul>
        <li>ボーナス・スタッキング (ボーナスの重ね使用)</li>
        <li>2ティアベット (2重賭け)</li>
        <li>リスクを軽減またはなくすために、ボーナスやクレジット資金を賭けている間に複数の結果をカバーする行為</li>
        <li>連続的スロットゲームのメカニズムを乱用するためのボーナス資金やクレジット資金の使用</li>
        <li>複数のアカウント戦略/プロキシアカウント戦略</li>
        <li>アフィリエイトもしくはレベニューシェアの悪用</li>
        <li>オポジットベット</li>
      </ul>
      <br />
      調査の結果、上記いずれかの行為に従事していたことが判明、または合理的な根拠が確認された場合、当社は、下記を行う権利を留保します :
      <br />
      <br />
      出金申請中のユーザーのアカウントの利用制限、および/または <br />
資金の没収、および/または <br />
アカウントの閉鎖、および/または <br />
今後の一部またはすべてのキャンペーンへの参加資格の取消、および/または
<br />利用可能なボーナスの受け取り資格の取消 <br />
これらの制限が課せられることで、制限が課せられる以前にユーザーが獲得資格を得たボーナスを受け取ることを妨げることはありません。
<br />
<br />
また、ユーザーがポイント入金を行った資金を使って、積極的にプレイをしなかった場合、当社は、変則的な特定の出金条件 (例 入金額の2倍) を課す場合があります。この条件には、当社の絶対的な裁量により、特定のゲームの条件を含んだり、または特定の低リスクの賭け、また低リスクのゲームタイプが除外される場合があります。これらの措置により、いかなる制限が課さられる以前に獲得した特典の権利を維持しながら、すべてのユーザーへの公平なゲーム体験が保証されます。
<br />
<br />
ポイント出金条件を満たす以前に、ユーザーが低リスクの賭け、低リスクのゲームタイプでプレイすることを選択した場合、当社が、当社の絶対的な裁量により、それらのゲームから得た勝利金を無効にする権利を有することをユーザーが承認するものとします。
    </p>
    <h3>10. ボーナス取得の選択</h3>
    <p>入金ボーナスポイントやクレジットポイントを受け取るためには、ボーナスやクレジットポイントの取得を希望する必要があります。<br /> <br />
ユーザーは、獲得資格のあるボーナスの受け取りを辞退することができます。すでにボーナスを受け取っている場合には、ボーナス取得後の最初の賭けを行う前に、カスタマーサポートに連絡し、ボーナスの削除を要請する必要があります。
</p>
    <h3></h3>
  </div>
</template>

<script lang="ts" setup></script>

<style lang="sass" scoped>
.info-wrapper
  margin-left: 1vw
  background: rgba(0, 0, 0, .9)
  border-radius: 10px
  padding: 25px 30px
  margin-bottom: 30px
  min-height: 500px
  font-size: 16px
  color: #D2D2D2
  li
    list-style-type: disc
    list-style-position: inside
    color: white

  h3
    font-size: 18px
    font-weight: bold

::v-deep p
  margin-bottom: 1rem
</style>
