<template>
  <div class="info-wrapper">
    <h3>1. 一般</h3>
    <p>
      1.1<br />
      このページは、{{ nowHost }}ウェブページの利用規約 (以下利用規約)
      を構成し、このサイトを利用するすべての登録ユーザーは必ず本利用規約に同意する必要があります。本利用規約およびこの中で明確に言及されている文書は、当事者間の合意および理解を構成し、当社とユーザーの契約関係を規定します。
      <br />
      {{ nowHost }}
      (以下ウェブサイト)
      を利用する前に、本利用規約をしっかりお読みの上、必ず理解してください。本利用規約にご同意いただけない場合には、ウェブサイトの使用および使用の継続をおやめください。また、プライバシーポリシーに関してもよく理解しておかれることをお勧めします。
    </p>

    <p>
      1.2<br />
      {{
        companyName
      }}は、適用される法律や規制およびその他の規制要件の順守など、さまざまな理由で本利用規約を随時変更する権利を留保します。したがって、当社はユーザーと{{
        companyName
      }}間の本契約を、いつでも改正できるものとします。
    </p>

    <p>
      1.3.1<br />
      当社ウェブサイトを通じて、ユーザーが参加を選択したゲームに適用される、追加ルールを含むゲーム情報
      (プレイするゲームを選択すると表示されます)(「ルール」)
    </p>

    <p>
      1.3.2<br />
      特定のキャンペーンに随時適用される当社のキャンペーン利用規約 (「キャンペーン利用規約」)
    </p>

    <p>
      1.3.3<br />
      当社がユーザーから収集した、またはユーザーから当社に提供された個人情報の処理に関する条件を定めた当社のプライバシーポリシー
    </p>

    <p>
      1.4<br />
      ユーザーは、随時改正されることがある本利用規約に含まれる条項に拘束されることを理解し、同意するものとします。さらに、当ウェブサイトまたは当社が時に所有する場合のある、その他のウェブサイトに登録およびそのサイトを使用することで、ルール、キャンペーン利用規約、プライバシーポリシーにも従い、またこれらをすべてを読み、理解したうえで承服するものとみなされます。
    </p>
    <p>
      1.5<br />
      本利用規約とルール、キャンペーン利用規約、またはプライバシーポリシーのいずれかとの間に矛盾が生じた場合、その矛盾する内容のみの範囲で、以下の優先順位が適用されます
    </p>

    <h3>2. 義務、必須条件および責任</h3>
    <p>
      2.1<br />
      本利用規約に同意しアカウント登録を行うことで、ユーザーは、次のことを表明し、保証するものとします:
    </p>
    <p>
      2.1.1<br />
      アカウントを個人的に登録する
      <br />ユーザー名およびパスワードを含むユーザーのすべてのアカウント情報、および/またはウェブサイトを介してユーザーのアカウントにアクセスするその他の方法に関する責任は、ユーザーが単独で負うものとします。<br />
      アカウントの安全性が損なわれた疑いがある場合は、直ちに当社に連絡し、アカウントとアカウントポイント残高への不正なアクセスを防ぐための適切な措置を講じる必要があります。
    </p>
    <p>
      2.1.2 <br />20歳以上であること。<br />
      20歳未満のプレイは禁止しています。上記に違反していると思われる合理的な理由があるアカウントは、直ちに閉鎖されます。
    </p>
    <p>
      2.1.3<br />
      当ウェブサイトで開設できるアカウントは一つのみです。<br />
      その理由 (既存のアカウントから自己除外した場合も含む)
      に関わらず、ユーザーが複数のアカウントの開設、または開設を試みた場合、当社の裁量で、ユーザーのいずれか、またはすべてのアカウントをブロックもしくは閉鎖する場合があります。これには、重複するアカウントでのプレイならびにベット
      (決済後または未決済に関わらず)
      を無効にすること、および、アカウント内の出金可能なポイントを保留または返却することが含まれます。
    </p>
    <p>
      2.1.4<br />
      ユーザーは、ユーザー自身の能力で、他の人に代わってではなくユーザー自身のために、楽しみや娯楽の目的のみで当ウェブサイトを利用するものとします。
    </p>
    <p>
      2.1.5<br />
      {{ companyName }}により、{{ nowHost }}を介してのみ、お客様の地域内のプレイヤーに提供されます。
    </p>
    <p>
      ユーザーの居住地域で、当社のウェブサイトを使用することが許可されているかどうかを確認するのはユーザーの責任です。あらゆる地域での当ウェブサイトの利用可能性は、当ウェブサイトが提供するサービスの利用の提案、もしくは勧誘を意味するものではありません。
      アメリカ合衆国、オランダ、フランス、オランダ領西インド諸島、およびキュラソー島に居住するプレイヤーによる当ウェブサイトでのアカウントの開設、または使用は認められておりません。なお、登録フォームに掲載されていない地域からのアクセスおよび登録は厳しく禁止されています
      (禁止地域)。
      <br />
      以下の例にあるような、この制限を回避しようとするすべての試みは、本利用規約の違反であり犯罪となる可能性があります:
      VPNやプロキシサーバー、または同様のサービスを使用してユーザーが実際にいる場所を隠したり偽装したりすること、ユーザーの国籍、現在地または居住地に関する虚偽、または誤解を招く情報を提供すること、当ウェブサイトで、第三者を介しての賭け、または禁止地域にいる第三者に代わっての賭けをすること。
      <br />ユーザーが禁止地域からウェブサイトにアクセスしていると考える合理的な理由がある場合には、事前の通知を行う義務を負うことなく、ユーザーのアカウントを閉鎖する場合があります。
    </p>
    <p>
      2.1.6<br />アカウントの登録時および存続期間中に要請されるお客様の情報は、真実で完全かつ正確に提供するものとします。お客様の情報は、氏名、住所、生年月日、メールアドレス、電話番号、決済情報などを含みますが、これに限定されることはありません。この義務を守り、情報が常に最新のものであることを保証するのはユーザーの責任です。情報が変更された場合、および登録フォームで提供した必須情報に変更があった場合は、当社に通知するものとします。
    </p>
    <p>
      2.1.7<br />
      当社から受け取った勝利金に対して、関連する法律に基づいて請求される可能性がある税金の申告、会計、および支払いはすべてユーザー一人の責任です。
    </p>
    <p>
      2.1.8<br />
      当ウェブサイトを使用するほかのプレイヤー、および{{ companyName }}
      の従業員であるサポートエージェントに対して、侮辱的もしくは節度を欠いた発言を避け、礼儀正しく接するものとします。チャットの使用は、当社のサービスおよびサービスに厳密に関連する問い合わせのみに限定されます。この条件の不履行は、いかなる状況下においても認められません。
    </p>
    <h3>3. アカウントと認証チェック</h3>
    <p>
      3.1<br />
      当ウェブサイトでプレイをするためには、まずユーザー自身が個人的にアカウント (「アカウント」)
      を開設する必要があります。当社が提供するゲームを実際にポイントを使ってプレイするためには、当ウェブサイトにて登録しなければなりません。{{
        companyName
      }}は、独自の裁量でアカウントの登録や開設を拒否する権利を有します。
    </p>
    <p>
      3.2<br />
      各ユーザー、IPアドレス、およびデバイスにつきに認められているのは、一アカウントのみです。複数のアカウントを持つユーザーを特定した場合は、当社の裁量で、重複したアカウントを閉鎖し、そのアカウントでのプレイならびにベット
      (決済後、未決済に関わらず) を無効にすること、および出金可能なポイントを保留または返却する権利を留保します。
    </p>
    <p>
      3.3<br />
      ログイン情報を安全に保管することは、ユーザー自身のみの限定責任です。ユーザーは、ログイン情報を決して誰にも開示してはいけません。当社は、意図的または偶発的、能動的または受動的だったに関わらず、第三者へのログイン情報の開示に起因する、第三者によるアカウントの悪用や誤用に関する責任を一切負いません。ユーザーのログイン情報を使用して行われた活動は、ユーザー自身によって実行されたものとみなされ、そのような活動から生じる責任はすべてユーザーが追うものとします。万が一、第三者がユーザーのログイン情報を認識している場合、当社に通知すること、およびログイン情報を変更することはユーザーの責任です。
    </p>
    <p>
      3.4<br />
      当社は、理由に関わらず、いつでもユーザーの身元確認を行い、関連する書類の提出を要請する権利を留保します。これには、以下の事項が含まれますがこれらに限定されません:
      身元調査、信用調査、または法律で認められてる個人履歴の調査。これらの調査の基準は各ケースによりますが、氏名、住所、年齢、職業などのユーザーの登録情報の確認、ユーザーの財務状況、資金源などのユーザーの金銭的取引の確認、および/またはゲーム履歴などを含みます。
      <br />
      要求された書類を{{
        companyName
      }}に提出しなかった場合、または書類またはその一部が虚偽、不正、または誤解を招くものであると判明した場合、{{
        companyName
      }}はそのような要求から60日以内にユーザーのアカウントをブロック、または閉鎖し、ユーザーのアカウントの残高を没収する権利を留保します。
      <br />
      {{
        companyName
      }}には、そのような調査が行われていることをユーザーに伝える義務は一切ないものとします。これらの調査には、許可を受けた信用照会機関、ユーザーの身元を確認するための身元確認サービス、および/または不正防止機関などの調査を行う特定の第三者企業の使用が含まれる場合があります。{{
        companyName
      }}は、これらの調査の結果が否定的または不確実な場合、独自の裁量でアカウントを閉鎖し、すべての残高を保留することがあります。プライバシーポリシーに従って処理されます。
    </p>
    <p>
      3.5<br />
      {{
        companyName
      }}eは、内部ポリシーに従って、ユーザーのアカウントでのポイント入金またはポイント出金の処理を行う際に、適正評価の書類の提出を含む追加の本人確認手続きを行う権利を留保します。適正評価手続きに使われるすべての書類が本物であることを保証するのはユーザーの責任です。
      <br />
      要求された書類を{{
        companyName
      }}に提出しなかった場合、または書類またはその一部が虚偽、不正、または誤解を招くものであると判明した場合、{{
        companyName
      }}はそのような要求から60日以内にユーザーのアカウントをブロック、または閉鎖し、ユーザーのアカウントの残高を没収する権利を留保します。
      <br />
      これらの確認手続きは、合理的な時間枠内で実行されるものとします。なお、疑義を避けるため、これらの確認手続きが実行されるまで、ユーザーのアカウントへの資金の支払いなどを遅らせる場合があります。
    </p>
    <p>
      3.6<br />
      AMUSEVIPの一カ月に出金可能なポイントは最大月間で10,000,000ptとなります。累積支払いの分割処理により毎月の精算が可能です。
    </p>
    <p>
      3.7<br />
      マネーロンダリング防止のため、すべての決済取引のチェックが行われます。<br />{{
        companyName
      }}およびすべての規制または管理機関は、犯罪防止の目的で、すべての取引のモニターまたは調査を要求することができます。{{
        companyName
      }}は、疑わしい取引を関連管轄当局に報告します。また、当社は、当社のゲーム、またはその他弊社が提供するプロダクトに関連する疑わしい行為を認識した場合は、直ちに関連機関に報告するものとします。{{
        companyName
      }}は、該当するマネーロンダリングおよびテロ資金供与防止の法律および規制に従って、アカウントの凍結または閉鎖、および未決済のベットを無効にし、および/またはアカウント残高の保留を行う場合があります。
    </p>
    <p>
      3.8<br />
      {{
        companyName
      }}は、当社独自の裁量で、いつでも、あらゆる理由により、個人のアカウントの開設を拒否する権利を留保します。ただし、{{
        companyName
      }}が既に関わった契約上の義務は、{{
        companyName
      }}が法律上利用可能な権利を損なうことない限り、履行されるものとします。
    </p>
    <p>
      3.9<br />
      ユーザーは、いつでもアカウントにログインし、ポイント入金、ボーナスクレジット、勝利金、賭け金、ポイント出金などのアカウント履歴を確認することができます。誤りに気付いた場合は、必要に応じて調査および修正ができるよう、直ちに{{
        companyName
      }}に報告する必要があります。
    </p>
    <p>
      3.10<br />
      ユーザーのアカウントに、クレジットや勝利ポイントまたはその他のポイントが誤って入金された場合には、ユーザーは、メールまたはチャットを使って、直ちに{{
        companyName
      }}に報告する必要があります。誤って入金された金額は例外なく{{
        companyName
      }}の所有物であり、ユーザーは該当する金額を直ちにアカウントから{{
        companyName
      }}に返金する必要があります。誤って入金されたポイントを出金した場合、ユーザーは、直ちに返済する必要のある出金額の{{
        companyName
      }}に対する清算債務者とみなされます。誤って入金されたクレジット、ポイントまたはその他のポイントを使用して賭けが行われた場合、これらの賭けはすべて無効となります。
    </p>
    <p>
      3.11<br />
      12か月連続でアカウントでの取引がみられない場合には、ユーザーのアカウントは休止状態とみなされます。{{
        companyName
      }}は、アカウントが休止状態となる1か月前までに、その旨をメールで連絡するものとします。ユーザーは、アカウントにログインすることでアカウントを再度有効にすることができます。アカウントが休止状態とみなされた後、{{
        companyName
      }}が合理的な努力を行ったにもかかわらずユーザーと連絡が取れない場合は、{{
        companyName
      }}は、ユーザーのアカウントから月々5%または$5のいずれか高い方に相当する金額を管理手数料として収受します。休止アカウントの手数料により、アカウント残高がゼロになる場合があります。管理手数料は、アカウントの休止状態期間中の健康障害、またはそのほかの合理的な原因の証明がある場合のみ返金されます。
    </p>
    <p>
      3.12<br />
      アカウントポイント残高にかかわらず、残高に利息は一切支払われません。したがってユーザーは、決して{{
        companyName
      }}を金融機関として扱わないものとします。
    </p>
    <p>
      3.13<br />
      ユーザーは、{{
        companyName
      }}が、ユーザーによる不正行為および共謀を固く禁じていることを理解し承認するものとします。不正行為や共謀が行われたと合理的に判断された場合、当社は、そのような行為の結果として行われたと思われる賭けを無効にし、および/またユーザーのアカウントからすべてのポイントを没収し、閉鎖する権利を留保します。ほかのプレイヤーが、不正行為や共謀によって不当な利益を得ていると考える合理的な根拠のあるユーザーは、メールまたはチャットで{{
        companyName
      }}に報告する必要があります。
    </p>
    <p>
      3.14<br />
      他のユーザーアカウントへのポイント移動は禁止されています。また、その逆も許可されません。
    </p>
    <p>
      3.15<br />
      ユーザーは、当ウェブサイトをハッキングしたり、いかなる方法でも当サイトのコードを変更したりしないことに同意します。また、当サイトを使用するにあたり、サイトの抜穴を悪用したり、ユーザー自身、または第三者による試行または作用にかかわらず、ロボット、自動的、機械的、電子的またはそのほかのデバイスを使用して、当サイトでの決断を自動的に行ったりしないことに同意するものとします。当社は、これらのデバイス、またはプレイヤーに不当な優位性を提供するように作られた外部のリソースが、当ウェブサイトで使用されていると合理的に判断された場合には、そのようなデバイスを使って行われたと思われる賭けを無効にする権利を留保します。当社は、調査の対象となるアカウントを一時閉鎖し、当社の独自の裁量でアカウントを閉鎖する場合があります。当社は、これらのデバイスの使用は詐欺行為と同様であるとみなし、このような場合には、アカウントが閉鎖された時点での残高の払い戻しを行わない権利を留保します。
    </p>

    <h3>4. ポイント購入・ポイント出金</h3>
    <p>
      4.1<br />
      アカウントへのポイント入金およびポイント出金において、ユーザーは、合法的な機関によって発行され、合法的にユーザーの名義である有効な決済手段のみを使用することに同意するものとします。ユーザーの決済手段の名義が、ユーザー自身のものではないと当社が判断した場合、または合理的な根拠がある場合、ユーザーのアカウントを閉鎖し、すべての勝利金を無効にする権利を留保します。{{
        companyName
      }}は、企業向けに発行されたカードの使用を禁止します。
    </p>
    <p>
      4.2<br />
      不正な手段で取得した資金でポイント購入することは違法です。適用される法律に従って、{{
        companyName
      }}は、可能であれば、ユーザーのアカウントへのポイント購入に使用された決済方法と同じ決済方法に送金を行います。<br />ポイント出金の支払いは、登録されたアカウント所有者の名義でのみ行うことが可能です。{{
        companyName
      }}は、クローズドループを実施するため、またはユーザーに特定の決済方法へ出金をするよう要求するため、出金をキャンセルする権利を留保します。
    </p>
    <p>
      4.3<br />
      ユーザーのアカウントからいかなる額のポイント出金申請を行うためには、当サイトでプレイする意思があり、不正行為や乱用がないことを示すため、最小で入金額の2倍以上にあたるポイント(クレジットポイントの場合はクレジットポイントの20倍)を、ゲームでのプレイにご利用いただくが必要がございます。
      {{
        companyName
      }}は、独自の裁量により、賭け不足に基づく引き出しの支払いを拒否する権利、および特定の条件において、追加で賭け、プレイを要求する権利を有します。<br />
      キャンペーン一般利用規約の第9条に記載の通り、ボーナス,クレジットポイントの乱用および/または,クレジットポイント,ボーナスの不正使用、またはポイントでの賭けに関し、あらゆる形態の乱用が疑われる場合、当社は調査を実施し、その結果が判定するまで、ユーザーのアカウントを制限する権利を留保します
      (保留中のポイント出金申請を含む)。
      <br />
      調査の結果、ユーザーが不正行為や乱用のいずれかに関与していたことが判明した場合、またはそのように考えられる合理的な理由がある場合、当社は、出金申請中のユーザーのアカウントの使用を制限し、および/またはユーザーの資金を没収し、および/またはユーザーのアカウントを閉鎖し、および/または今後のマーケティングキャンペーンへの参加資格および/または利用可能な特典を受け取る権利を、剥奪する権利を留保します。
      <br />
      これらの制限が課せられることで、制限が課せられる以前にプレイヤーが獲得資格を得たボーナスを受け取ること、または不正使用による影響を受けていない以前のポイントでのプレイを承認することを、妨げることはありません。
      <br />一方で、キャンペーン一般利用規約第5条の出金賭け条件反映率から除外のその他のゲームには、最小で入クレジットポイントの20倍以上にあたるポイントを、ゲームでのプレイにご利用いただく必要はありません。
    </p>
    <p>
      4.5<br />
      クレジットポイントはウェブサイト上で賭けに利用する必要があり、そのまま出金する事はできません。
      <br />
      クレジットポイントは、利用規約に沿って条件を達成すると、換金される場合があります。全てのマーケティングキャンペーンの一環として提供される特典は、キャンペーン規約に準じます。詳しくは各キャンペーン利用規約をご参照ください。
    </p>
    <p>
      4.6<br />
      アカウントへのポイント購入、およびポイント出金は、常に金融機関、または決済サービス機関を通じて行われます。ポイント購入・ポイント出金の手続き、利用規約、利用可能性、手数料および処理時間は、関連する金融機関または決済サービス機関によって異なる場合があります。
    </p>
    <p>
      4.7<br />
      アカウントに十分なポイントを維持し、それに応じて賭けを行うことはユーザーの責任です。アカウントポイント残高が不十分な場合のギャンブル取引は成立しません。当社は、ユーザーのアカウントにすべてのプレイを補う十分なポイントがない場合、不注意で行われたまたは受け入れられた賭けを無効にする権利を留保します。決済処理機関によってポイント購入がキャンセルされた結果、アカウントのポイント不足が生じた場合、{{
        companyName
      }}は、受理された賭けをその時点から遡及してキャンセルし、これらの賭けからユーザーに対して支払われた勝利金を無効にする権利を留保します。
    </p>
    <p>
      4.8<br />
      出金手続きが完了するまでに要する時間は状況により異なりますが、通常1～3営業日の間で行われます。
    </p>
    <p>
      4.9<br />
      アカウントへのポイント購入は、ユーザーのゲームプレイに相応している必要があります。アカウントの不正使用の疑いが持たれる場合は、当社は、独自の裁量により、アカウントを閉鎖し、勝利ポイント並びにアカウントポイント残高を没収する権利を有します。これらの不正使用には、ポイント出金要請が行われる前に、入金ポイントでの賭けが行われていない場合や、不適切な使用などが含まれます。
    </p>
    <h3>5. ゲーム特有のルール</h3>
    <p>
      5.1<br />
      本第5.1項は、カジノゲームのみに適用されます。ユーザーは、プレイするカジノゲームの選択時に、そのゲーム特有に適用される追加のカジノルールが提示される場合があります。いずれかのカジノゲームに参加する前に、関連するカジノルール、および本項をよくお読みください。当ウェブサイトのカジノゲームに参加することで、ユーザーは、関連するカジノルール、および本利用規約を承認し、順守することに同意したものとみなされます。
    </p>
    <p>
      5.1.1<br />
      「無料ゲーム」モードでのゲームプレイから得た勝利金およびアカウント残高は、一切の商業的価値を持たず、現金、クレジット、またいかなる形の利益として償還されることはありません。
    </p>
    <p>
      5.1.2<br />
      当ウェブサイトで提供されているゲームは、ランダム・ナンバー・ジェネレーター (RNG)
      を使用し、各ゲームの無作為なゲーム結果、およびプロダクトやゲームが公正であることを保証します。この乱数システムは、認可を受けた独立した第三者機関により監査認証されています。当ウェブサイトの「無料ゲーム」モードと「リアルマネー」モードには、まったく同じ乱数ジェネレーターが使用されています。この条項から逸脱する場合は、個別のプロモーション規約に定められます。
    </p>
    <h3>6. 保証と責任</h3>
    <p>
      6.1<br />
      {{ companyName }}は以下の事項を保証しません:
      当ウェブサイトが完璧で、エラーなく作動すること、ウェブサイトおよび当サイトで提供しているゲームに中断なくアクセスできること、ウェブサイトおよびゲームが目的に適合していること。{{
        companyName
      }}は明示的または示唆的にかかわらず、このような保証は一切いたしかねます。
    </p>
    <p>
      6.2<br />
      予期できない技術的な問題、または第三者プロバイダーの技術的な問題といった{{
        companyName
      }}の管理外の状況において、{{
        companyName
      }}は、賭けのキャンセルおよび/または払い戻しを行うことができるものとします。また、ユーザーは、ユーザーのコンピューター機器またはモバイルデバイス、およびインターネットの接続が、ウェブサイトの性能と操作に影響する可能性があることを認識するものとします。<br />
      {{
        companyName
      }}は、ユーザーの機器、インターネット接続、または第三者プロバイダーに起因する故障や問題に関して一切責任を負いません。これには、賭けができない、または特定のゲームに関連する情報の表示または受信ができない場合も含まれます。
    </p>
    <p>
      6.3<br />
      いかなる理由に関わらず、中断または切断された承認済みのゲームラウンドが生じた場合、すべてのユーザーの取引は正確に記録されています。未完了のゲームラウンドは、通常、ゲームが再開されると復元されるか、またはそれが不可能な場合には、そのゲームラウンドは{{
        companyName
      }}により削除され、賭け金額がユーザーのアカウントに払い戻されます。
    </p>
    <p>
      6.4<br />
      {{
        companyName
      }}は独自の裁量で、ユーザーに事前通知することなく、当ウェブサイトおよび/または特定のゲームを一時的に利用不可能にする権利を留保します。当社は、こういった状況の結果としてユーザーに生じた損失について一切の責任を負いません。
    </p>
    <p>
      6.5<br />
      {{
        companyName
      }}、その関連会社、代理店は、いかなるダウンタイム、サーバーの中断、遅延、またはゲームプレイの技術的もしくは政治的妨害についての一切の責任を負いません。払い戻しは、{{
        companyName
      }}の裁量のみで行われるものとします。
    </p>
    <h3>7. 免責事項</h3>
    <p>
      7.1<br />
      ユーザーは、当ウェブサイトで提供されるサービスが娯楽目的のみであることを認めるものとします。ユーザーは、当サービスを使用することを要求されてはおらず、ユーザーのみの選択および裁量で当サイトのサービスに参加するものとします。結果として、ユーザーは、ユーザー自身の責任で当ウェブサイトを訪れ、ゲームに参加します。ユーザーは、当ウェブサイトおよびサービスへの関心は、職業上のものではなく個人的なものであり、個人の娯楽の目的のみでアカウントを登録したと断言するものとします。当社が提供するサービスのその他の目的の使用は、固く禁じられています。
    </p>
    <p>
      7.2<br />
      前述の規定の一般性を失うことなく、{{
        companyName
      }}およびその取締役、従業員、パートナー、第三者のゲーム配信会社は、法律または契約上の義務で許可されている範囲で、直接的、間接的、特徴的、結果的、偶発的またはその他のかたちに関わらず、ユーザーの当ウェブサイトの使用またはゲームへの参加に関連して生じた、いかなる損失、費用、経費または損害について責任を負いません。
      <br />なお、ゲームでのエラーまたは誤作動に対する{{ companyName }}の責任は当該ゲームの交換に限定されます。
    </p>
    <p>
      7.3<br />
      当ウェブサイトに表示されているすべての情報は、情報提供のみを目的として提供されており、いかなる性質の専門的なアドバイスを提供することは意図していません。{{
        companyName
      }}およびその独立したプロバイダーは、情報の誤り、不完全性、不正確さ、遅延、またはその中に含まれる情報に依存して取られた行動について、責任を負いません。
    </p>
    <h3>8. 知的財産</h3>
    <p>
      8.1<br />
      ウェブサイト上のすべての知的財産権 (IP権) は、{{
        companyName
      }}または第三者のソフトウェアプロバイダーに帰属します。当ウェブサイトを利用することによって、当サイトまたはソフトウェアプロバイダーの知的財産権の所有権が、ユーザーに付与されることはありません。知的財産権には、特許、著作権、意匠権、商標、データベース権やこれらいずれかのアプリケーション、また著作者人格権、ノウハウ、企業秘密、ドメイン名、URL、商号、およびその他すべての知的財産権および産業所有権などがありますが、登録の有無、登録が可能であるかどうか、特定の国や地域、または世界の他の地域に存続するかどうかにかかわらず、これらに限定されません。
    </p>
    <p>
      8.2<br />
      ユーザーは、適用する法律で規定された範囲内で以下のことを行うことはできません:
    </p>
    <p>
      8.2.1<br />
      ソフトウェアおよび/またはウェブサイトのコピー、配布、公開、リバースエンジニアリング、逆コンパイル、逆アセンブル、修正または翻訳を行ったり、ソフトウェアおよび/またはウェブサイトのソースコードから二次的著作物を作成するためにソースコードにアクセスしようとすること
    </p>
    <p>
      8.2.2<br />
      ソフトウェアおよび/またはウェブサイト、またはその一部から、著作権、所有権、または同様の表示を削除すること；
    </p>
    <p>
      8.2.3<br />
      ソフトウェアの販売、譲渡、再許諾、移譲、配布、または賃貸
    </p>
    <p>
      8.2.4<br />
      コンピューターネットワークなどを介して、第三者がソフトウェアを使用できるようにすること
    </p>
    <p>
      8.2.5<br />
      物理的または電子的手段を問わず、ソフトウェアを他国に輸出すること
    </p>
    <p>
      8.2.6<br />
      適用される法律または規制で禁止されている方法でソフトウェアを使用すること
    </p>
    <p>
      8.2.7<br />
      IP権に害を及ぼす、またはその可能性がある行為を行うこと、また、{{
        companyName
      }}、その従業員、取締役、役員、およびコンサルタントのイメージや世評を損なう行為を行うこと
    </p>
    <p>
      8.2.8<br />
      もしくは、本利用規約で明確に許可されていない方法で、ソフトウェアおよび/またはウェブサイト、またはその一部を使用すること。
    </p>
    <p>
      8.3<br />
      ユーザーは、ウェブサイトまたはゲームに関連してユーザーが使用する名前や画像 (ユーザー名など)
      が、第三者の知的財産権、プライバシー、またはその他の権利を損害したり、他者に対して不快なものでないことを保証するものとします。ユーザーは、当社のプライバシーポリシーの条件に従い、ウェブサイトまたはゲームに関連するあらゆる目的で、これらの名前および画像を使用する、世界的、取り消し不能、譲渡可能、著作権使用料無料の再許諾可能な許可を{{
        companyName
      }}に付与します。
    </p>
    <h3>9. クレーム・仲裁</h3>
    <p>
      9.1<br />
      当ウェブサイトに関するクレームの申し立ては、ウェブサイトの手順に従ってカスタマーサポートチームまでご連絡ください。または、LINEにてご連絡ください。<br />
      特定のゲームに関するクレームは、当該事項が発生してから暦日7日以内に申し立てる必要があります。支払い、アカウントの停止、ボーナスの計算を含むそのほかの事項に関するクレームは、当該事項発生から暦月1か月以内に申し立てを行う必要があります。
    </p>
    <p>
      9.2<br />
      クレームはカスタマーサポートチームにより対処され、サポートエージェントが直ちに解決できない場合には{{
        companyName
      }}内でエスカレーションされます。ユーザーは、クレームの状況について合理的に通知されるものとします。当社は、可能な限り短い時間で、通常の状況においては14営業日以内に、クレームを解決するよう常に努めるものとします。
    </p>

    <h3>10. アカウントの一時停止、または閉鎖</h3>
    <p>
      10.1<br />
      以下の場合には、当社の絶対的な裁量により、いかなる説明も無く、ユーザーのアカウントの一時停止、または閉鎖、ユーザーが行ったプレイのキャンセル、アカウント内のボーナスポイントの削除、クレジットウォレットポイントおよび/または、当社が適切と判断するその他の措置を施行する権利を、当社は留保します。
    </p>
    <p>
      10.1.1<br />
      ユーザーとの取引関係を継続することが、当社の規制義務全般、または当社のあらゆるサービスに悪影響を及ぼす可能性があるとみなした場合;
      <br />
      および/または
    </p>
    <p>
      10.1.2<br />
      ユーザーが、当ウェブサイトを使用中に、違法または詐欺行為に関与していると疑いが当社によりもたれた場合;<br />
      および/または
    </p>
    <p>
      10.1.3<br />
      ユーザーが、本利用規約またはルールに違反していると疑いが当社によりもたれた場合;<br />
      および/または
    </p>
    <p>
      10.1.4<br />
      法律により、要請された場合
    </p>
    <p>
      10.2<br />
      この第11条に概説されている理由により、ユーザーのアカウントが当社により閉鎖された場合の唯一の救済措置は、ユーザーが、本利用規約およびルールを遵守していることを条件として、その時点でユーザーが保有する、異議のないアカウント残高を返済することです。当社は、法律で認められている最大限の範囲で、それ以上の責任を負わないものとします。
    </p>
    <p>
      10.3<br />
      上記は、状況に応じて適切とみなされる場合に、ユーザーに対して法的措置を講じる当社の権利を排除するものではありません。
    </p>

    <h3>11. 雑則</h3>
    <p>
      11.1<br />
      {{
        companyName
      }}が解散または事実上その業務を終了することになった場合には、ユーザーは事前に通知されるものとします。通知後、{{
        companyName
      }}には、有効解散日または終了日まで、本利用規約から生じる義務を履行する責任があるものとします。
    </p>
    <p>
      11.2<br />
      本利用規約は、情報提供および利便性の目的で、多言語にて公開されていますが、英語版の本利用規約が他の言語版に優先するものとします。
    </p>
    <p>
      11.3<br />
      当社は、当社の合理的な管理が及ばない事件、出来事、または原因に起因する当社の本利用規約に基づく義務の履行遅延または不履行について、本利用規約に違反したとされず責任を負わないものとします。
    </p>
    <p>
      11.4<br />
      本利用規約のいずれかの規定が、違法または法的強制力がないと判断された場合、そのような規定は本利用規約から分離されます。その他のすべての規定は引き続き有効であり、この分離による影響は一切受けません。
    </p>
    <h3>12. アカウントの作成と管理</h3>
    <p>
      12.1<br />
      ユーザーは、正確かつ最新の情報を提供してアカウントを作成する必要があります。 <br />-
      複数のアカウントの作成は禁止されています。 <br />-
      アカウントの管理はユーザー自身の責任です。パスワードの紛失や第三者による不正利用について、会社は一切の責任を負いません。
    </p>
    <p>
      12.2 利用制限<br />
      - ユーザーは、以下の行為を行うことを禁止されます： <br />
      - 不正アクセス、ハッキング、チートツールの使用 <br />
      - 他ユーザーへの嫌がらせ、脅迫、暴言 <br />
      - 著作権、商標権、その他の知的財産権の侵害 <br />
      - 上記の行為が発覚した場合、即座にアカウント停止または削除される可能性があります。
    </p>

    <h3>13. ポイントの獲得と利用</h3>
    <p>- ポイントの譲渡、交換、現金化は禁止されています。</p>
    <h3>14. ポイントの購入と返金</h3>
    <p>
      - ユーザーは、任意でポイントを購入することができます。
      <br />
      - 一度購入されたポイントの返金は、いかなる理由があっても一切行いません。
      <br />
      - ポイント購入に関するトラブルや紛争が生じた場合、当社の決定を最終とし、ユーザーはこれに従うものとします。
    </p>
    <h3>15. ゲーム内アイテムの購入と使用</h3>
    <p>
      - ゲーム内アイテムは、ポイントを使用して購入できます。<br />
      - 購入後のアイテムの譲渡、交換、現金化を禁止します。<br />
      - すべてのゲーム内アイテムは、当社の所有物であり、ユーザーに対して使用権のみが付与されます。<br />
      - ゲーム内アイテムの効果や性能は、事前の通知なしに変更されることがあります。
    </p>

    <h3>16. サービスの変更および終了</h3>
    <p>
      - 当社は、ユーザーに通知することなく、サービス内容を変更、中止、終了する権利を有します。<br />
      - サービス終了の場合、ユーザーは保有するゲーム内アイテムや未使用のポイントについて補償を請求することはできません。
    </p>

    <h3>17. 責任の制限</h3>

    <p>
      - 当社は、サービスの中断、エラー、データの喪失、またはユーザーが被った損害について、一切の責任を負いません。<br />
      - ユーザーは、サービスの利用に際して発生する全てのリスクと責任を自己の負担とします。
    </p>
    <h3>18. プライバシーとデータ収集</h3>
    <p>
      -
      当社は、ユーザーの個人情報を適切に管理し、第三者に提供しないものとします。ただし、法律に基づく要求があった場合を除きます。<br />
      - ユーザーのプレイデータや行動履歴は、サービス向上のために収集・利用されることがあります。
    </p>
    <h3>19. 規約の変更</h3>

    <p>
      -
      当社は、本利用規約をいつでも変更する権利を有します。変更後の規約は、当社のウェブサイトに掲載された時点で有効となります。<br />
      - ユーザーは、変更後の規約に従うことを承諾するものとします。
    </p>

    <h3>注意事項</h3>
    <p>
      この利用規約概要は、実際の法律や規制を考慮して作成されたものではありません。実際に利用規約を策定する際は、法律専門家や法務部門と相談の上、法的な整合性を確認してください。また、ユーザーの理解と同意を得るために、利用規約の内容はわかりやすく明確に記載することが重要です。
    </p>
  </div>
</template>

<script lang="ts" setup>
import { useEnv } from "src/common/hooks/useEnv"

const { companyName, nowHost } = useEnv()
</script>

<style lang="sass" scoped>
.info-wrapper
  margin-left: 1vw
  background: rgba(0, 0, 0, .9)
  border-radius: 10px
  padding: 25px 30px
  margin-bottom: 30px
  min-height: 500px
  font-size: 16px
  color: #D2D2D2
  h3
    font-size: 18px
    font-weight: bold

::v-deep p
  margin-bottom: 1rem
</style>
